IdeaRS.OpenModel.OpenModelClassAttribute
Base attribute of the Open model

IdeaRS.OpenModel.OpenModelClassAttribute.#ctor(System.String,System.String,System.Type)
Constructor
structuralModelClassType: Equivalent SM type
structuralModelContainerType: SM container type
openModelListType: List type in Open Model

IdeaRS.OpenModel.OpenModelClassAttribute.#ctor(System.String,System.Type)
Constructor
structuralModelClassType: Equivalent SM type
openModelListType: List type in Open Model

IdeaRS.OpenModel.OpenModelClassAttribute.#ctor(System.String,System.String)
Constructor
structuralModelClassType: Equivalent SM type
structuralModelContainerType: SM container type

IdeaRS.OpenModel.OpenModelClassAttribute.#ctor(System.String)
Constructor
structuralModelClassType: Equivalent SM type